Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum
Engine parameter.

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.Label
Label

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.DesignCodeFile
Design codes file path

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.DesignCodeAilFile
Design codes ail file path

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ConnectivitySplitting
Connectivity splitting ("0" if using bars, "1" if using members)

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.RigidDiaphMasterSlave
Rigid diaphragm as master/slave

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.SplitPlateOutlines
Split plate outlines

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.CreatePlateLoadNodes
Create plate load nodes

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ResultsExistCheckFile
Results exists check file

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ResultsClearFiles
Results clear files

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.StartupParameter
Startup parameter

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.OpenRun
Application to open in run

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.OpenRunParameters
Application start parameters in run

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.OpenCreateModel
Application to open in create model

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.OpenCreateModelParameters
Application start parameters in create model

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.OpenViewResults
Application to open in view results

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.OpenViewResultsParameters
Application start parameters in view results

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.RunIsExternal
Run is external

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ViewResultsIsExternal
View results is external

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ExportProfileMappingFile
Profile mapping file for export from TS

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ImportProfileMappingFile
Profile mapping file for import to TS

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.RuncheckProcessName
Run check process name (process which needs to be closed before run)

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.FemImport
Is FEM import supported 0/1

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.Import
Is import to TS supported 0/1

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.FileExtension
File extension of export file

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.GetResultsPlugin
Name of plugin to use for analysis results import

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComProgidAnalysis
COM Progid Analysis

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComProgidMaterial
COM Progid Material

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComProgidCrossSection
COM Progid CrossSection

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComSendPhysicalMembers
Send physical members 0/1 (COM API)

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComSendGuids
Send physical member GUIDs 0/1 (COM API)

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComSendLoadGroupTypes
Send load group types 0/1 (COM API)

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComSendDesignGroups
Send design groups 0/1 (COM API)

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComSendPartPosition
Send part position number 0/1 (COM API)

Tekla.Structures.AnalysisInternal.AnalysisEngine.ParameterEnum.ComSendPartAssemblyPosition
Send assembly position number 0/1 (COM API)